HelpDesk/src/InformationRegisters/ВременныеФайлыОбъектов/ВременныеФайлыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВременныеФайлыОбъектов</name>
  <resources>
    <name>Объект</name>
    <type>
      <types>CatalogRef.СтатьиБазыЗнаний</types>
      <types>DocumentRef.Заявка</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
    </type>
  </resources>
  <dimensions>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

HelpDesk/src/InformationRegisters/ОбъектыHTMLСтраниц/ОбъектыHTMLСтраниц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыHTMLСтраниц</name>
  <resources>
    <name>Вложение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.СтатьиБазыЗнаний</types>
      <types>DocumentRef.Заявка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

HelpDesk/src/InformationRegisters/ПодписчикиЗаявок/ПодписчикиЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодписчикиЗаявок</name>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

HelpDesk/src/Enums/ВидыСобытийПоЗаявке/ВидыСобытийПоЗаявке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСобытийПоЗаявке</name>
  <enumValues>
    <name>Передача</name>
  </enumValues>
  <enumValues>
    <name>Дополнение</name>
  </enumValues>
  <enumValues>
    <name>ИзмененСтатус</name>
  </enumValues>
  <enumValues>
    <name>Зарегистрирована</name>
  </enumValues>
  <enumValues>
    <name>Объединена</name>
  </enumValues>
  <enumValues>
    <name>Получение</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаРегистрации</name>
  </enumValues>
</mdclass:Enum>

HelpDesk/src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <basedOn>Document.Заявка</basedOn>
  <basedOn>Catalog.Проекты</basedOn>
  <basedOn>Catalog.ПроектныеЗадачи</basedOn>
  <basedOn>Document.ВходящееПисьмо</basedOn>
  <basedOn>Document.ИсходящееПисьмо</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗаявки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаЗакрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокЗаявки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СостоянияЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаявки</name>
    <type>
      <types>CatalogRef.ТипыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Заявка</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроектнаяЗадача</name>
    <type>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗаявкиHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЗаявки</name>
    <type>
      <types>CatalogRef.ОбъектыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>КалендарьСотрудника</name>
    <type>
      <types>CatalogRef.КалендариСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ПриоритетыЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавнаяЗаявка</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТекстыДополнений</name>
    <attributes>
      <name>ТипДополнения</name>
      <type>
        <types>EnumRef.ВидыСобытийПоЗаявке</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеДополнения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеДополненияHTML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдДополнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаВложенийОбъекта</name>
    <comment>Хранит данные переданные из модуля объекта при создании документа программно</comment>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

HelpDesk/src/Catalogs/СостоянияЗаявок/СостоянияЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостоянияЗаявок</name>
  <predefined>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>Зарегистрирована</name>
      <description>Зарегистрирована</description>
    </items>
    <items>
      <name>Объединена</name>
      <description>Объединена</description>
    </items>
    <items>
      <name>ВОчереди</name>
      <description>Ожидание</description>
    </items>
    <items>
      <name>Отменена</name>
      <description>Отменена</description>
    </items>
  </predefined>
</mdclass:Catalog>

HelpDesk/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <comment>Контрагент</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НашаОрганизация</name>
      <description>Наша организация</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетЗаявокПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьДляОповещений</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <comment>Тип</comment>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <comment>Вид</comment>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <comment>Представление</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

HelpDesk/src/CommonModules/РаботаСЗаявкамиИПочтой/Module.bsl
Процедура ОбработатьВходящееПисьмо(ПисьмоСсылка) Экспорт 
	Если ПисьмоСсылка.УчетнаяЗапись.АвтоматическиСоздаватьЗаявки = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если ПисьмоСсылка.Тема = "Тестовое письмо (1С:Поддержка пользователей)" Тогда
		Возврат;               //Тестовое письмо не обрабатываем
	КонецЕсли;
	
	Если ПисьмоСсылка.ОтправительАдрес = ПисьмоСсылка.УчетнаяЗапись.АдресЭлектроннойПочты Тогда
		Возврат;               //Письма от самих себя не обрабатываем
	КонецЕсли;

	//Определим есть ли в письме указание на заячку (в случае ответа на письмо)
	Заявка = ОпределитьЗаявкуОснованиеПоПисьму(ПисьмоСсылка);	
	
	Если значениеЗаполнено(Заявка) Тогда 
		//Проверим нашу заявку
		Если Заявка.Статус = Справочники.СостоянияЗаявок.Выполнена 
			ИЛИ Заявка.Статус = Справочники.СостоянияЗаявок.Отменена Тогда
			
			МенеджерЗаписи = РегистрыСведений.ОповещенияПоЗаявкам.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Заявка = Заявка;
			МенеджерЗаписи.УчетнаяЗапись = ?(ЗначениеЗаполнено(Заявка.Контрагент.УчетнаяЗаписьДляОповещений),Заявка.Контрагент.УчетнаяЗаписьДляОповещений,ВстроеннаяПочтаСервер.ПолучитьУчетнуюЗаписьДляОтправки());
			МенеджерЗаписи.Событие = Перечисления.ВидыСобытийПоЗаявке.ОшибкаРегистрации;
			МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
			
			МенеджерЗаписи.Записать();
		Иначе
			ДобавитьОтветКЗаявке(ПисьмоСсылка,Заявка);
		КонецЕсли;
	Иначе
		// Сформируем новую заявку
		Заявка = Документы.Заявка.СоздатьДокумент();
		Заявка.ТекущийИсполнитель = Справочники.Пользователи.РаспределительЗаявок;
		Заявка.Заполнить(ПисьмоСсылка);
		Заявка.Записать();		
		  		  
		// оповестим о регистрации заявки в системе	
		МенеджерЗаписи = РегистрыСведений.ОповещенияПоЗаявкам.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Заявка = Заявка.Ссылка;
		МенеджерЗаписи.УчетнаяЗапись = ?(ЗначениеЗаполнено(Заявка.Контрагент.УчетнаяЗаписьДляОповещений),Заявка.Контрагент.УчетнаяЗаписьДляОповещений,ВстроеннаяПочтаСервер.ПолучитьУчетнуюЗаписьДляОтправки());
		МенеджерЗаписи.Событие = Перечисления.ВидыСобытийПоЗаявке.Зарегистрирована;
		МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
		
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
	ОбработатьНеОтвеченныеСобытияОповещения(Заявка.Ссылка);
КонецПроцедуры // ОбработатьВходящееПисьмо()

Функция НайтиСоздатьПользователяПоАдресуОтправителя(ОтправительАдрес) Экспорт 
	СтруктураОтправителя = РаботаСоСтроками.РазложитьАдресЭлектроннойПочты(ОтправительАдрес);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиКонтактнаяИнформация.Ссылка
		|ИЗ
		|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
		|ГДЕ
		|	ПользователиКонтактнаяИнформация.АдресЭП = &АдресЭП";
	
	Запрос.УстановитьПараметр("АдресЭП", СокрЛП(СтруктураОтправителя.Адрес));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;

	// не нашли пользователя
	
	ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
	ПользовательОбъект.Наименование	= СтруктураОтправителя.Пользователь;
	
	НовыйАдрес = ПользовательОбъект.КонтактнаяИнформация.Добавить();
	НовыйАдрес.АдресЭП				= СокрЛП(СтруктураОтправителя.Адрес);
	НовыйАдрес.ДоменноеИмяСервера	= СтруктураОтправителя.Домен;
	НовыйАдрес.Представление		= СтруктураОтправителя.Представление;
	
	Если Не ЗначениеЗаполнено(НовыйАдрес.Представление) Тогда
		НовыйАдрес.Представление = СокрЛП(СтруктураОтправителя.Адрес);
	КонецЕсли;
	
	НовыйАдрес.Вид					= Справочники.ВидыКонтактнойИнформации.EmailПользователя;
	НовыйАдрес.Тип					= Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		
	ПользовательОбъект.Недействителен = Ложь;

	//Информация по домену пользователя
	Если ЗначениеЗаполнено(СтруктураОтправителя.Домен) Тогда
		СтрокиДомен = ПользовательОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.ДоменноеИмяПользователя));
		Если СтрокиДомен.Количество() > 0 Тогда
			СтрокаДомен = СтрокиДомен[0];
		Иначе
			СтрокаДомен = ПользовательОбъект.КонтактнаяИнформация.Добавить();
			СтрокаДомен.Вид = Справочники.ВидыКонтактнойИнформации.ДоменноеИмяПользователя;
		КонецЕсли;
		СтрокаДомен.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
		СтрокаДомен.Представление = СтруктураОтправителя.Пользователь;
		
		АккаунтОС = "\\" + СтруктураОтправителя.Домен + "\" + СтруктураОтправителя.Пользователь;
		
		ОписаниеПользователяИБ = Пользователи.НовоеОписаниеПользователяИБ();
		
		ОписаниеПользователяИБ.Имя =СтруктураОтправителя.Пользователь;
		ОписаниеПользователяИБ.ПолноеИмя = СтруктураОтправителя.Пользователь;
		ОписаниеПользователяИБ.АутентификацияСтандартная = Ложь;
		ОписаниеПользователяИБ.АутентификацияOpenID = Ложь;
		ОписаниеПользователяИБ.АутентификацияОС = Истина;
		ОписаниеПользователяИБ.ПользовательОС = АккаунтОС;
		ОписаниеПользователяИБ.ПоказыватьВСпискеВыбора = Ложь;
		ОписаниеПользователяИБ.ЗапрещеноИзменятьПароль = Истина;
		ОписаниеПользователяИБ.РежимЗапуска = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение;
		ОписаниеПользователяИБ.Вставить("Действие", "Записать");
		
		ПользовательОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
		
	КонецЕсли;
	
	ПользовательОбъект.Записать();
	
	ПрофильНовогоПользователяПоУмолчанию = Константы.ПрофильНовогоПользователяПоУмолчанию.Получить();
	Если ЗначениеЗаполнено(ПрофильНовогоПользователяПоУмолчанию) Тогда
		ТаблицаПрофилей = Новый ТаблицаЗначений();
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.ПрофилиГруппДоступа"));
		ОписаниеТиповПрофили = Новый ОписаниеТипов(МассивТипов);
		МассивТипов.Очистить();
		МассивТипов.Добавить(Тип("Булево"));
		ОписаниеТиповБ = Новый ОписаниеТипов(МассивТипов);
		ТаблицаПрофилей.Колонки.Добавить("Профиль",ОписаниеТиповПрофили);
		ТаблицаПрофилей.Колонки.Добавить("Пометка",ОписаниеТиповБ);
		
		НовСтр = ТаблицаПрофилей.Добавить();
		НовСтр.Пометка = Истина;
		НовСтр.Профиль = ПрофильНовогоПользователяПоУмолчанию;

		ОбновитьПраваПользователя(ПользовательОбъект.Ссылка,ТаблицаПрофилей);
	КонецЕсли;

	Возврат ПользовательОбъект.Ссылка;
	
КонецФункции // НайтиСоздатьПользователяПоАдресуОтправителя()

Функция НайтиКонтрагентаПоАдресуОтправителя(ОтправительАдрес) Экспорт 
	Возврат Справочники.Контрагенты.НашаОрганизация;	
КонецФункции // НайтиСоздатьПользователяПоАдресуОтправителя()

Процедура РассылкаОповещенийПоЗаявкам() Экспорт
	ОбработатьНеОтвеченныеСобытияОповещения();
КонецПроцедуры

Процедура ОбработатьНеОтвеченныеСобытияОповещения(Заявка=Неопределено) 		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОповещенияПоЗаявкам.УчетнаяЗапись,
		|	ОповещенияПоЗаявкам.Заявка,
		|	ОповещенияПоЗаявкам.Событие,
		|	ОповещенияПоЗаявкам.ИдСобытия,
		|	ОповещенияПоЗаявкам.Письмо,
		|	ОповещенияПоЗаявкам.ДатаСобытия
		|ИЗ
		|	РегистрСведений.ОповещенияПоЗаявкам КАК ОповещенияПоЗаявкам
		|ГДЕ
		|	ОповещенияПоЗаявкам.Письмо = &Письмо
		|	И ВЫБОР
		|			КОГДА &ЗаявкаЗаполнена = ИСТИНА
		|				ТОГДА ОповещенияПоЗаявкам.Заявка = &Заявка
		|			ИНАЧЕ Истина
		|		КОНЕЦ";
	Запрос.УстановитьПараметр("Письмо",Документы.ИсходящееПисьмо.ПустаяСсылка());
	Запрос.УстановитьПараметр("Заявка",Заявка);
	Запрос.УстановитьПараметр("ЗаявкаЗаполнена",ЗначениеЗаполнено(Заявка));

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.УчетнаяЗапись) Тогда
			Продолжить;
		КонецЕсли;
		
		Письмо =  СформироватьПисьмоОповещениеПоСобытию(ВыборкаДетальныеЗаписи.УчетнаяЗапись,ВыборкаДетальныеЗаписи.Событие,ВыборкаДетальныеЗаписи.Заявка,ВыборкаДетальныеЗаписи.ИдСобытия);
		 Если Письмо <> Неопределено Тогда
			 МенеджерЗаписи = РегистрыСведений.ОповещенияПоЗаявкам.СоздатьМенеджерЗаписи();
			 ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ВыборкаДетальныеЗаписи,"УчетнаяЗапись,Заявка,Событие,ИдСобытия");
			 МенеджерЗаписи.Прочитать();
			 Если МенеджерЗаписи.Выбран() Тогда
				 МенеджерЗаписи.Письмо = Письмо;
				 МенеджерЗаписи.Записать();
			 КонецЕсли;				 
		 КонецЕсли;	 
	 КонецЦикла;
	 
	ВстроеннаяПочтаСервер.ПолучениеИОтправкаПисем();
КонецПроцедуры

Функция СформироватьПисьмоОповещениеПоСобытию(УчетнаяЗапись,Событие,Заявка,ИдСобытия)
	
	//Определяем текст для подстановки
	СтруктураПоиска = Новый Структура();
	СтруктураПоиска.Вставить("Событие",Событие);

	ФайлКПисьму = Справочники.Файлы.ПустаяСсылка();
	МассивСтрокШаблона = УчетнаяЗапись.ОбработкаСобытийЗаявок.НайтиСтроки(СтруктураПоиска);
	Если МассивСтрокШаблона.Количество() = 0 Тогда
		Шаблон = "";
		ШаблонТемы = "";
	Иначе
		Шаблон = МассивСтрокШаблона.Получить(0).Сообщение;
		ШаблонТемы = МассивСтрокШаблона.Получить(0).Тема;
		ФайлКПисьму = МассивСтрокШаблона.Получить(0).Файл;
	КонецЕсли;
	
	ПисьмоОбъект = Документы.ИсходящееПисьмо.СоздатьДокумент();
	
	ШаблонПисьма = УстановитьПараметрыВТексте(Шаблон,Заявка);

   	ШаблонHTML = ПисьмоОбъект.СформироватьИсходящееHTML(ШаблонПисьма);
	
	ТаблицаКартинок = ПолучитьКартинкиИзЗаявки(Заявка,Новый УникальныйИдентификатор);	

	//Получим данные по дополнению для письма
	СтруктураПоиска = Новый Структура();
	СтруктураПоиска.Вставить("ИдДополнения",ИдСобытия);
	ОписаниеДополненияHTML = "";
	МассивФайлов = Новый Массив();
	Если Событие = Перечисления.ВидыСобытийПоЗаявке.Дополнение Тогда
		МассивСтрок = Заявка.ТекстыДополнений.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрок.Количество()>0 Тогда
			ТекСтрокаСобытия = МассивСтрок.Получить(0);
			ОписаниеДополненияHTML = ТекСтрокаСобытия.ОписаниеДополненияHTML;
		КонецЕсли;	
		
		Для Каждого Стр Из ТаблицаКартинок Цикл
			Если СтрНайти(ОписаниеДополненияHTML,Стр.Ключ)> 0 Тогда
				Картинка = ПолучитьИзВременногоХранилища(Стр.Адрес);
				Если ТипЗнч(Картинка) = Тип("Картинка") Тогда
					Картинка = Картинка.ПолучитьДвоичныеДанные()
				ИначеЕсли ТипЗнч(Картинка) <> Тип("ДвоичныеДанные") Тогда 
					СообщениеОбОшибке = "Во время отправки письма произошла ошибка - ""Не предусмотреный тип картинки в тесте письма!""";
					Почта.ЗаписатьОшибкуВЖурналРегистрации(СообщениеОбОшибке);
					Продолжить;
				КонецЕсли;
				ИмяВремФайла = ПолучитьИмяВременногоФайла("jpg");
				Картинка.Записать(ИмяВремФайла);
				//ОписаниеДополненияHTML = СтрЗаменить(ОписаниеДополненияHTML,"src='"+Стр.Ключ,"src='data:image;base64," + Base64Строка(Картинка));
				//ОписаниеДополненияHTML = СтрЗаменить(ОписаниеДополненияHTML,"src="""+Стр.Ключ,"src=""data:image;base64," + Base64Строка(Картинка));
				
				ОписаниеДополненияHTML = СтрЗаменить(ОписаниеДополненияHTML,"src='"+Стр.Ключ,"src='file://" + ИмяВремФайла);
				ОписаниеДополненияHTML = СтрЗаменить(ОписаниеДополненияHTML,"src="""+Стр.Ключ,"src=""file://" + ИмяВремФайла);
				МассивФайлов.Добавить(ИмяВремФайла);
			КонецЕсли;					
		КонецЦикла;
	КонецЕсли;	
	
	ШаблонHTML = СтрЗаменить(ШаблонHTML,"##ОписаниеДополненияКЗаявке##","</p>"+ОписаниеДополненияHTML+"<p>");
	          
	Кодировка = "UTF-8";
	ЗаявкаHTML = РаботаСЗаявками.ПолучитьТекстHTMLЗаявки(Заявка,Кодировка,Новый УникальныйИдентификатор,Истина);
	ШаблонHTML = СтрЗаменить(ШаблонHTML,"##ИсторияПоЗаявке##","</p>"+ЗаявкаHTML+"<p>");
	
	УстановитьПредставлениеСсылкиНаЗаявку(ШаблонHTML,Заявка);
	
	Если ТипЗнч(Заявка.ДокументОснование) = Тип("ДокументСсылка.ВходящееПисьмо") Тогда
		ЗначенияЗаполнения = Новый Структура("Команда, Письмо", "Ответить", Заявка.ДокументОснование);
		СтруктураРеквизитов = ПисьмоОбъект.СформироватьСтруктуруРеквизитовПисьма(ЗначенияЗаполнения);
		
		//Меняем в шаблоне реквизиты на реквизиты заявки
		ТекстПисьма = СтрЗаменить(ШаблонHTML,"##ТекстИсходногоПисьма##",СтруктураРеквизитов.ТекстПисьма);	
		
		//Меняем в шаблоне темы текст
		ШаблонТемы = СтрЗаменить(ШаблонТемы,"##ТемаИсходногоПисьма##",СтруктураРеквизитов.Тема);
		ТекстТемы = УстановитьПараметрыВТексте(ШаблонТемы,Заявка);	
	Иначе
		ЗначенияЗаполнения = Новый Структура("Команда, Письмо", "Ответить", Заявка);
		СтруктураРеквизитов = ПисьмоОбъект.СформироватьСтруктуруРеквизитовПисьма(ЗначенияЗаполнения);

		//Меняем в шаблоне реквизиты на реквизиты заявки
		ТекстПисьма = СтрЗаменить(ШаблонHTML,"##ТекстИсходногоПисьма##",Заявка.ОписаниеЗаявкиHTML);	
		
		//Меняем в шаблоне темы текст
		ШаблонТемы = СтрЗаменить(ШаблонТемы,"##ТемаИсходногоПисьма##",Заявка.Тема);
		ТекстТемы = УстановитьПараметрыВТексте(ШаблонТемы,Заявка);	
	КонецЕсли;
	СтруктураРеквизитов.УчетнаяЗапись = УчетнаяЗапись;
	СтруктураРеквизитов.Тема = ТекстТемы; 
	ЗаполнитьЗначенияСвойств(ПисьмоОбъект, СтруктураРеквизитов);
	ПисьмоОбъект.ТипТекста = Перечисления.ТипыТекстовПочтовыхСообщений.HTML;
	ПисьмоОбъект.Кодировка = Кодировка;
	
	//Для каждого СтруктураАдресата Из СтруктураРеквизитов.ПолучателиПисьма Цикл
	//	ЗаполнитьЗначенияСвойств(ПисьмоОбъект.ПолучателиПисьма.Добавить(), СтруктураАдресата);
	//КонецЦикла;

	Если Событие = Перечисления.ВидыСобытийПоЗаявке.Получение Тогда
		//Отправляем текущему исполнителю
		Получатель = Заявка.ТекущийИсполнитель;
		Если ЗначениеЗаполнено(Получатель) Тогда
			АдресПолучателя = ПолучитьАдресПользователя(Получатель);
			Если ЗначениеЗаполнено(АдресПолучателя) Тогда
				НоваяСтр = ПисьмоОбъект.ПолучателиПисьма.Добавить();
				НоваяСтр.Адрес = АдресПолучателя;
				НоваяСтр.Контакт = Получатель;
				НоваяСтр.ОтображаемоеИмя = Получатель.Наименование;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если Событие = Перечисления.ВидыСобытийПоЗаявке.Зарегистрирована Тогда
			Если ЗначениеЗаполнено(Заявка.ДокументОснование) И ТипЗнч(Заявка.ДокументОснование) = Тип("ДокументСсылка.ВходящееПисьмо") Тогда
				//В случае если заявка зарегистрирована по письму пользователя мы отсылаем ему ответ с номером заявки
				
				//Отправляем постановщику
				Получатель = Заявка.Постановщик;
				Если ЗначениеЗаполнено(Получатель) Тогда
					АдресПолучателя = ПолучитьАдресПользователя(Получатель);
					Если ЗначениеЗаполнено(АдресПолучателя) Тогда
						НоваяСтр = ПисьмоОбъект.ПолучателиПисьма.Добавить();
						НоваяСтр.Адрес = АдресПолучателя;
						НоваяСтр.Контакт = Получатель;
						НоваяСтр.ОтображаемоеИмя = Получатель.Наименование;
					КонецЕсли;
				КонецЕсли;
				
				// отправим копию распределителю
				Распределитель = УчетнаяЗапись.РаспределительЗаявок;
				Если ЗначениеЗаполнено(Распределитель) Тогда
					АдресРаспределителя = ПолучитьАдресПользователя(Распределитель);
					Если ЗначениеЗаполнено(АдресРаспределителя) Тогда
						НоваяСтр = ПисьмоОбъект.ПолучателиКопий.Добавить();
						НоваяСтр.Адрес = АдресРаспределителя;
						НоваяСтр.Контакт = Распределитель;
						НоваяСтр.ОтображаемоеИмя = Распределитель.Наименование;
					КонецЕсли;
				КонецЕсли;	
			Иначе
				//В случае если заявка зарегистрирована вручную то
				// отправим только распределителю
				Распределитель = УчетнаяЗапись.РаспределительЗаявок;
				Если ЗначениеЗаполнено(Распределитель) Тогда
					АдресРаспределителя = ПолучитьАдресПользователя(Распределитель);
					Если ЗначениеЗаполнено(АдресРаспределителя) Тогда
						НоваяСтр = ПисьмоОбъект.ПолучателиПисьма.Добавить();
						НоваяСтр.Адрес = АдресРаспределителя;
						НоваяСтр.Контакт = Распределитель;
						НоваяСтр.ОтображаемоеИмя = Распределитель.Наименование;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе //во всех остальных случаях	
			//Отправляем постановщику
			Получатель = Заявка.Постановщик;
			Если ЗначениеЗаполнено(Получатель) Тогда
				АдресПолучателя = ПолучитьАдресПользователя(Получатель);
				Если ЗначениеЗаполнено(АдресПолучателя) Тогда
					НоваяСтр = ПисьмоОбъект.ПолучателиПисьма.Добавить();
					НоваяСтр.Адрес = АдресПолучателя;
					НоваяСтр.Контакт = Получатель;
					НоваяСтр.ОтображаемоеИмя = Получатель.Наименование;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура();
		//Добавим данные подписчиков
		ТаблицаПодписчиков = ПолучитьТаблицуПодписчиков(Заявка);
		Для Каждого Стр Из ТаблицаПодписчиков Цикл
			Получатель = Стр.Пользователь;
			Если ЗначениеЗаполнено(Получатель) Тогда
				АдресПодписчика = ПолучитьАдресПользователя(Получатель);
				Если ЗначениеЗаполнено(АдресПодписчика) Тогда
					СтруктураПоиска.Очистить();
					СтруктураПоиска.Вставить("Адрес",АдресПодписчика);
					
					МассивСтрокАдресов = ПисьмоОбъект.ПолучателиКопий.НайтиСтроки(СтруктураПоиска);
					Если МассивСтрокАдресов.Количество() > 0 Тогда
						Продолжить;
					КонецЕсли;	
					
					МассивСтрокАдресов = ПисьмоОбъект.ПолучателиПисьма.НайтиСтроки(СтруктураПоиска);
					Если МассивСтрокАдресов.Количество() > 0 Тогда
						Продолжить;
					КонецЕсли;	

					НоваяСтр = ПисьмоОбъект.ПолучателиКопий.Добавить();
					НоваяСтр.Адрес = АдресПодписчика;
					НоваяСтр.Контакт = Получатель;
					НоваяСтр.ОтображаемоеИмя = Получатель.Наименование;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	ПисьмоОбъект.ТекстХранилище			= Новый ХранилищеЗначения(ТекстПисьма, Новый СжатиеДанных);
	ПисьмоОбъект.ПодготовленоКОтправке	= ТекущаяДатаСеанса();
	ПисьмоОбъект.Предмет = Заявка;
	ПисьмоОбъект.Проект = Заявка.Проект;
	ПисьмоОбъект.Записать();
	
	//Прикрепим текст заявки
	//Кодировка = КодировкаТекста.UTF8;
	//ЗаявкаHTML = РаботаСЗаявками.ПолучитьТекстHTMLЗаявки(Заявка,Кодировка,Новый УникальныйИдентификатор);
	//ВложениеРазмер = СтрДлина(ЗаявкаHTML);	

	//ИмяВременногоФайла = ПолучитьИмяВременногоФайла("html");
	//ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, ?(ТипЗнч(Заявка.ДокументОснование) = Тип("ДокументСсылка.ВходящееПисьмо"),Заявка.ДокументОснование.Кодировка,КодировкаТекста.ANSI));
	//ЗаписьТекста.Записать(ЗаявкаHTML);
	//ЗаписьТекста.Закрыть();
	//Данные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	//Адрес = ПоместитьВоВременноеХранилище(Данные, Новый УникальныйИдентификатор() );
	//ВстроеннаяПочтаСервер.ДобавитьВложениеПисьмаИзВременногоХранилища(
	//						ПисьмоОбъект.Ссылка, // Письмо
	//						Адрес, // АдресВременногоХранилища
	//						"", // АдресВременногоХранилищаТекста
	//						ВложениеРазмер,
	//						"Ticket#"+Заявка.Номер+".html",
	//						ТекущаяДата(), // ВремяИзменения
	//						Неопределено); // Идентификатор - идентификатор картинки
	
	
	КопироватьФайлыЗаявкиВПисьмо(Заявка,ПисьмоОбъект.Ссылка);
	
	Если ЗначениеЗаполнено(ФайлКПисьму) Тогда
		ФайлСобытия = ФайлКПисьму.Ссылка.Скопировать();
		ФайлСобытия.ВладелецФайла = ПисьмоОбъект.Ссылка;
		ФайлСобытия.Записать();	
	КонецЕсли;
	
	Если МассивФайлов.Количество() <> 0 Тогда
		ЗаписатьИнформациюПоВременнымФайлам(МассивФайлов,ПисьмоОбъект.Ссылка);
	КонецЕсли;
	
	Возврат ПисьмоОбъект.Ссылка;
КонецФункции

Процедура ЗаписатьИнформациюПоВременнымФайлам(МассивФайлов,Письмо) Экспорт
	Для Каждого ИмяФайла Из МассивФайлов Цикл
		Менеджер = РегистрыСведений.ВременныеФайлыОбъектов.СоздатьМенеджерЗаписи();
		Менеджер.Объект = Письмо;
		Менеджер.ИмяФайла = ИмяФайла;
		Менеджер.Записать();
	КонецЦикла;	
КонецПроцедуры

Функция ПолучитьКартинкиИзЗаявки(ЗаявкаСсылка,УникальныйИдентификатор)  Экспорт
	ТаблицаКартнок = Новый ТаблицаЗначений;
	ТаблицаКартнок.Колонки.Добавить("Ключ");
	ТаблицаКартнок.Колонки.Добавить("Адрес");
	
	// прочитаем картинки заявки 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыHTMLСтраниц.Идентификатор,
	|	ОбъектыHTMLСтраниц.Вложение
	|ИЗ
	|	РегистрСведений.ОбъектыHTMLСтраниц КАК ОбъектыHTMLСтраниц
	|ГДЕ
	|	ОбъектыHTMLСтраниц.Владелец = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаявкаСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ТаблицаКартнок.Добавить();
		НоваяСтрока.Ключ = ВыборкаДетальныеЗаписи.Идентификатор;
		НоваяСтрока.Адрес = ПоместитьВоВременноеХранилище(ВыборкаДетальныеЗаписи.Вложение.Получить(),УникальныйИдентификатор);
	КонецЦикла;
	
	Возврат ТаблицаКартнок;
КонецФункции // ПолучитьКартинкиИзЗаявки()

Функция ПолучитьАдресПользователя(Пользователь) Экспорт
	
	ТаблицаКонтактов = УправлениеКонтактнойИнформацией.ЗначенияКонтактнойИнформацииОбъекта(
		Пользователь,
		Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		
	Если ТаблицаКонтактов.Количество() > 0 Тогда
		Возврат ТаблицаКонтактов[0].Значение;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура КопироватьФайлыЗаявкиВПисьмо(Заявка,Письмо) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Файлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Файлы КАК Файлы		
		|ГДЕ
		|	Файлы.ВладелецФайла = &Заявка
		|");
		
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ФайлЗаявки = Выборка.Ссылка.Скопировать();
		ФайлЗаявки.ВладелецФайла = Письмо;
		ФайлЗаявки.Записать();
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьТаблицуПодписчиков(Заявка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодписчикиЗаявок.Пользователь
		|ИЗ
		|	РегистрСведений.ПодписчикиЗаявок КАК ПодписчикиЗаявок
		|ГДЕ
		|	ПодписчикиЗаявок.Заявка = &Заявка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПодписчикиЗаявок.Пользователь";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблВозврата = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблВозврата;	
КонецФункции

Функция УстановитьПараметрыВТексте(Шаблон,Заявка)
	СоответствиеПараметров = Новый Соответствие();
	
	НачПоз = 1;
	Пока СтрНайти(Шаблон,"##<",,?(НачПоз>=СтрДлина(Шаблон),СтрДлина(Шаблон),НачПоз))<> 0 Цикл
		НачалоЭлемента = СтрНайти(Шаблон,"##<",,НачПоз)+3;
		КонецЭлемента =  СтрНайти(Шаблон,">##",,НачалоЭлемента);
		
		Если КонецЭлемента = 0 Тогда
			//Похоже не закрыли тег
			Прервать;
		КонецЕсли;	
		
		ТекстПараметра = СокрЛП(Сред(Шаблон,НачалоЭлемента,КонецЭлемента-НачалоЭлемента));
		ТекстПараметра = СтрЗаменить(ТекстПараметра,"<","");
		ТекстПараметра = СтрЗаменить(ТекстПараметра,">","");
		ТекстПараметра = СтрЗаменить(ТекстПараметра," ","");
		
		СоответствиеПараметров.Вставить(СокрЛП(ТекстПараметра),"");
		
		НачПоз = КонецЭлемента+3;
	КонецЦикла;	
	
	Для Каждого Стр Из СоответствиеПараметров Цикл
		ТекПараметр = Стр.Ключ;
		Если СтрНайти(Шаблон,".")<> 0 Тогда //У нас сложный параметр
			мнСтрока = СтрЗаменить(ТекПараметр,".",Символы.ПС);
			СтрокаВыполнения = "";
			Значение ="";

			Для Счетчик = 1 По СтрЧислоСтрок(мнСтрока) Цикл
    			ТекСтрокаПараметра = СтрПолучитьСтроку(мнСтрока, Счетчик);
				СтрокаВыполнения = ?(Счетчик = 1,"Заявка","")+СтрокаВыполнения + "["""+СокрЛП(ТекСтрокаПараметра)+"""]";
			КонецЦикла;
			Попытка
				Если ЗначениеЗаполнено(СтрокаВыполнения) Тогда 
					СтрокаВыполнения = "Значение = Строка(" + СтрокаВыполнения+")";
					Выполнить(СтрокаВыполнения);
				Иначе
					Значение ="";
				КонецЕсли;
			Исключение КонецПопытки;
		Иначе
			Попытка
				Значение = Строка(Заявка[ТекПараметр]);	
			Исключение КонецПопытки;	
		КонецЕсли;	
		Шаблон = СтрЗаменить(Шаблон,"##<"+Стр.Ключ+">##",Значение);	
	КонецЦикла;
	
	Возврат Шаблон;
КонецФункции

Процедура УстановитьПредставлениеСсылкиНаЗаявку(Шаблон,Заявка)
	ПредставлениеСсылки = "Ссылка на заявку";
	СсылкаНаЗаявку = СокрЛП(Константы.НавигационнаяСсылкаНаБазу.Получить())+"#"+ПолучитьНавигационнуюСсылку(Заявка);
	
	//Сначала обработаем те ссылки которые не имеют представления
	Шаблон = СтрЗаменить(Шаблон,"##СсылкаНаЗаявку##","<h2 style=""margin:0cm;margin-bottom:.0001pt;line-height:12pt""><span style=""font-size:9pt;font-family:""Trebuchet MS"",sans-serif;mso-fareast-font-family:""Times New Roman"";color:#222222""><a href='"+СсылкаНаЗаявку+"'>"+ПредставлениеСсылки+"</a></span></h2>");

	//Затем обработаем ссылки которые имеют представление
	НачПоз = 1;
	Пока СтрНайти(Шаблон,"##СсылкаНаЗаявку{",,?(НачПоз>=СтрДлина(Шаблон),СтрДлина(Шаблон),НачПоз))<> 0 Цикл
		НачалоЭлемента = СтрНайти(Шаблон,"##СсылкаНаЗаявку{",,НачПоз)+17;
		КонецЭлемента =  СтрНайти(Шаблон,"}##",,НачалоЭлемента);
		
		Если КонецЭлемента = 0 Тогда
			//Похоже не закрыли тег
			Прервать;
		КонецЕсли;	
		
		ТекстПараметра = СокрЛП(Сред(Шаблон,НачалоЭлемента,КонецЭлемента-НачалоЭлемента));
		ТекстПараметра = СтрЗаменить(ТекстПараметра,"}","");
		ТекстПараметра = СтрЗаменить(ТекстПараметра,"{","");

		Шаблон = Лев(Шаблон,НачалоЭлемента-18) +"<h2 style=""margin:0cm;margin-bottom:.0001pt;line-height:12pt""><span style=""font-size:9pt;font-family:""Trebuchet MS"",sans-serif;mso-fareast-font-family:""Times New Roman"";color:#222222""><a href='"+СсылкаНаЗаявку+"'>"+ТекстПараметра+"</a></span></h2>"+ Сред(Шаблон,КонецЭлемента+3); 	
		НачПоз = КонецЭлемента+17;
	КонецЦикла;
	
КонецПроцедуры

//процедура создана на базе типовой процедуры ЗаписатьИзмененияНаСервере модуля общей формы ПраваДоступаУпрощенно
Процедура ОбновитьПраваПользователя(Пользователь, ПрофилиПользователя) 
	
	// Получение списка изменений.
	Запрос = Новый Запрос;
		
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Профили", ПрофилиПользователя);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Профили.Профиль КАК Ссылка,
	|	Профили.Пометка
	|ПОМЕСТИТЬ Профили
	|ИЗ
	|	&Профили КАК Профили
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Профили.Ссылка,
	|	ЕСТЬNULL(ГруппыДоступа.Ссылка, НЕОПРЕДЕЛЕНО) КАК ПерсональнаяГруппаДоступа,
	|	ВЫБОР
	|		КОГДА ГруппыДоступаПользователи.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Пометка
	|ПОМЕСТИТЬ ТекущиеПрофили
	|ИЗ
	|	Справочник.ПрофилиГруппДоступа КАК Профили
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступа
	|		ПО Профили.Ссылка = ГруппыДоступа.Профиль
	|			И (ГруппыДоступа.Пользователь = &Пользователь
	|				ИЛИ Профили.Ссылка В (ЗНАЧЕНИЕ(Справочник.ПрофилиГруппДоступа.Администратор)))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|		ПО (ГруппыДоступа.Ссылка = ГруппыДоступаПользователи.Ссылка)
	|			И (ГруппыДоступаПользователи.Пользователь = &Пользователь)
	|ГДЕ
	|	НЕ Профили.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Профили.Ссылка КАК Профиль,
	|	ГруппыДоступаЗначенияДоступа.ВидДоступа,
	|	ГруппыДоступаЗначенияДоступа.ЗначениеДоступа
	|ПОМЕСТИТЬ ТекущиеЗначенияДоступа
	|ИЗ
	|	ТекущиеПрофили КАК Профили
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.ЗначенияДоступа КАК ГруппыДоступаЗначенияДоступа
	|		ПО Профили.ПерсональнаяГруппаДоступа = ГруппыДоступаЗначенияДоступа.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрофилиИзмененныхГрупп.Профиль
	|ПОМЕСТИТЬ ПрофилиИзмененныхГрупп
	|ИЗ
	|	(ВЫБРАТЬ
	|		Профили.Ссылка КАК Профиль
	|	ИЗ
	|		Профили КАК Профили
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекущиеПрофили КАК ТекущиеПрофили
	|			ПО Профили.Ссылка = ТекущиеПрофили.Ссылка
	|	ГДЕ
	|		Профили.Пометка <> ТекущиеПрофили.Пометка) КАК ПрофилиИзмененныхГрупп
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Профили.Ссылка КАК Профиль,
	|	СправочникПрофили.Наименование КАК ПрофильНаименование,
	|	Профили.Пометка,
	|	ТекущиеПрофили.ПерсональнаяГруппаДоступа
	|ИЗ
	|	ПрофилиИзмененныхГрупп КАК ПрофилиИзмененныхГрупп
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Профили КАК Профили
	|		ПО ПрофилиИзмененныхГрупп.Профиль = Профили.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекущиеПрофили КАК ТекущиеПрофили
	|		ПО ПрофилиИзмененныхГрупп.Профиль = ТекущиеПрофили.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа КАК СправочникПрофили
	|		ПО (СправочникПрофили.Ссылка = ПрофилиИзмененныхГрупп.Профиль)";
	
	//НачатьТранзакцию();
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.ПерсональнаяГруппаДоступа) Тогда
				ЗаблокироватьДанныеДляРедактирования(Выборка.ПерсональнаяГруппаДоступа);
				ГруппаДоступаОбъект = Выборка.ПерсональнаяГруппаДоступа.ПолучитьОбъект();
			Иначе
				// Создание персональной группы доступа.
				ГруппаДоступаОбъект = Справочники.ГруппыДоступа.СоздатьЭлемент();
				//ГруппаДоступаОбъект.Родитель     = Справочники.ГруппыДоступа.РодительПерсональныхГруппДоступа();
				ГруппаДоступаОбъект.Наименование = Выборка.ПрофильНаименование;
				ГруппаДоступаОбъект.Пользователь = Пользователь;
				ГруппаДоступаОбъект.Профиль      = Выборка.Профиль;
			КонецЕсли;
			
			Если Выборка.Профиль = Справочники.ПрофилиГруппДоступа.Администратор Тогда
				
				Если Выборка.Пометка Тогда
					Если ГруппаДоступаОбъект.Пользователи.Найти(
							Пользователь, "Пользователь") = Неопределено Тогда
						
						ГруппаДоступаОбъект.Пользователи.Добавить().Пользователь = Пользователь;
					КонецЕсли;
				Иначе
					ОписаниеПользователя =  ГруппаДоступаОбъект.Пользователи.Найти(
						Пользователь, "Пользователь");
					
					Если ОписаниеПользователя <> Неопределено Тогда
						ГруппаДоступаОбъект.Пользователи.Удалить(ОписаниеПользователя);
						
						Если НЕ ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
							// Проверка пустого списка пользователей ИБ в группе доступа Администраторы.
							НайденПользовательИБ = Ложь;
							Для каждого ОписаниеПользователя ИЗ ГруппаДоступаОбъект.Пользователи Цикл
								Если ЗначениеЗаполнено(ОписаниеПользователя.Пользователь)
								   И ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
								     	ОписаниеПользователя.Пользователь.ИдентификаторПользователяИБ)
								     	<> Неопределено Тогда
									
									НайденПользовательИБ = Истина;
									Прервать;
								КонецЕсли;
							КонецЦикла;
							Если НЕ НайденПользовательИБ Тогда
								ВызватьИсключение
									НСтр("ru = 'Профиль Администратор должен быть хотя бы у одного пользователя,
									           |которому разрешен доступ к информационной базе.'");
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				ГруппаДоступаОбъект.Пользователи.Очистить();
				Если Выборка.Пометка Тогда
					ГруппаДоступаОбъект.Пользователи.Добавить().Пользователь = Пользователь;
				КонецЕсли;
				
			КонецЕсли;
			ГруппаДоступаОбъект.Записать();
			
			Если ЗначениеЗаполнено(Выборка.ПерсональнаяГруппаДоступа) Тогда
				РазблокироватьДанныеДляРедактирования(Выборка.ПерсональнаяГруппаДоступа);
			КонецЕсли;
		КонецЦикла;
		//ЗафиксироватьТранзакцию();
		Модифицированность = Ложь;
	Исключение
		//ОтменитьТранзакцию();
		ЕстьОшибки = Истина;
		ВызватьИсключение ("Ошибка про создании/обновлении прав пользователя " + Пользователь + ": " + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ДобавитьОтветКЗаявке(Письмо,Заявка)
	Постановщик = РаботаСЗаявкамиИПочтой.НайтиСоздатьПользователяПоАдресуОтправителя(Письмо.ОтправительАдрес);
	
	ТекстПисьма = Письмо.ТекстПисьмаHTMLХранилище.Получить();
	
	Если ТекстПисьма = Неопределено Тогда
		ТекстПисьма = Письмо.ТекстПисьмаПростойТекстХранилище.Получить();
		Если ТекстПисьма <> Неопределено Тогда
			ТекстПисьма = "<p>"+ТекстПисьма+"</p>";
		Иначе
			ТекстПисьма = "";
		КонецЕсли;	
	КонецЕсли;
	
	ТаблицаВложения = ВстроеннаяПочтаСервер.ПолучитьФайлыПисьма(
	Письмо, // Письмо
	Истина, // ФормироватьРазмерПредставление
	Истина); // ВключатьПомеченныеНаУдаление

	//Обработаем текст письма если он пришел от outlok 2003 и выше
	ТекстПисьма = ВыделитьТекстПисьмаOutlook(ТекстПисьма);

	Заявкаобъект = Заявка.Получитьобъект();
	СтруктураТекстов = Заявкаобъект.ПолучитьСтруктуруТекстовСВложениями(ТекстПисьма,ТаблицаВложения);	
	
	НовСтр = Заявкаобъект.ТекстыДополнений.Добавить();	
	НовСтр.ТипДополнения =  Перечисления.ВидыСобытийПоЗаявке.Дополнение;
	НовСтр.ОписаниеДополнения  = СтруктураТекстов.ОписаниеЗаявки;
	НовСтр.ОписаниеДополненияHTML = СтруктураТекстов.ОписаниеЗаявкиHTML;
	НовСтр.ИдДополнения = Строка(Новый УникальныйИдентификатор());
	НовСтр.ДатаСоздания = Текущаядата();
	НовСтр.Пользователь = Постановщик;
 
	Заявкаобъект.КопироватьФайлыПисьмаВЗаявку(Письмо);
	Заявкаобъект.СохранитьОбъектыВложенийHTML(СтруктураТекстов.ОписаниеЗаявкиHTML,Заявкаобъект.ТаблицаВложенийОбъекта.Выгрузить()); 
	Заявкаобъект.ТаблицаВложенийОбъекта.Очистить();
	
	Заявкаобъект.Записать();
КонецПроцедуры

Функция ВыделитьТекстПисьмаOutlook (Знач ТекстПисьма)  Экспорт
	Если СтрНайти(ТекстПисьма,"content=""Microsoft") <> 0 Тогда
		НачалоПисьма = СтрНайти(ТекстПисьма,"div class=""WordSection");
		Если НачалоПисьма <> 0 Тогда
			КонецПисьма = СтрНайти(ТекстПисьма,"<div>",,НачалоПисьма);
			Если КонецПисьма <> 0 Тогда
				ТекстПисьма = Сред(ТекстПисьма,НачалоПисьма-1,КонецПисьма-НачалоПисьма+6);
			КонецЕсли;	
		КонецЕсли;		
	КонецЕсли;	
	Возврат ТекстПисьма;
КонецФункции

Функция ОпределитьЗаявкуОснованиеПоПисьму(Письмо)
	 Заявка = Документы.Заявка.ПустаяСсылка();
	 
	 ТемаПисьма = Письмо.Тема;
	 
	 НомРазделителя = СтрНайти(ТемаПисьма,"#"); 
	 Если НомРазделителя > 0 Тогда
		НомПробела  = СтрНайти(ТемаПисьма," ",,НомРазделителя);
		Если ЗначениеЗаполнено(НомПробела) Тогда
			НомерЗаявки = СокрЛП(Сред(ТемаПисьма,НомРазделителя+1,НомПробела));
		Иначе
			НомерЗаявки = СокрЛП(Сред(ТемаПисьма,НомРазделителя+1));
		КонецЕсли;
		
		Попытка 
			НомерЗаявкиЧислом = Число(НомерЗаявки);
		Исключение 
			Возврат Заявка;
		КонецПопытки;	
		
		Заявка = Документы.Заявка.НайтиПоНомеру(НомерЗаявкиЧислом,ТекущаяДата());
	 КонецЕсли;
	 
	 Возврат Заявка;
КонецФункции
